import { Injectable } from "@angular/core"

@Injectable({
    providedIn: 'root'
  })
export class StaticVariables {
    daragat = [
        'لاشئ',
        'جندي',
        'عريف',
        'رقيب',
        'رقيب أ',
        'مساعد',
        'مساعد أ',
        'ملازم',
        'ملازم أ',
        'نقيب',
        'رائد',
        'مقدم',
        'عقيد',
        'عميد',
        'لواء'
    ]

    state = [
        'لاشئ',
        'قيد الاصلاح',
        'تم الاصلاح'
    ]

    // branches = [
    //     'لاشئ',
    //     'علوم هندسة',
    //     'صواريخ',
    //     'تخطيط',
    //     'لواء الطلبة',
    //     'مجمع تعليمي',
    //     'إدارة محلية',
    //     'اركان حرب',
    //     'شئون ضباط',
    //     'علاقات',
    //     'عمليات',
    //     'امن',
    //     'اشارة',
    //     'سنة تكملية',
    //     'مستشفي',
    //     'نظم المعلومات',
    //     'تنظيم وادارة',
    //     'السكرتارية',
    //     'متابعة',
    //     'لغات',
    //     'علوم عسكرية',
    //     'انذار',
    //     'مدفعية',
    //     'لواء الجنود',
    //     'مركز ثقافي',
    //     'صناع',
    //     'رئيس تعليم د جو',
    //     'الخزينة',
    //     'الماليات',
    //     'الشرطة العسكرية',
    //     'الحملة والمركبات',
    //     'المسجل',
    //     'الفروسية',
    //     'اسلحة وذخيرة',
    //     'إمداد وتموين',
    //     'التربية الرياضية',
    //     'وسائل تعليمية',
    //     'الكنترول',
    //     'الشئون النفسية',
    //     'القضاء العسكري',
    //     'ورشة الانتاج',
    //     'مساعد المدير ش ف أ',
    //     'مدير الكلية',
    //     'نائب مدير الكلية',
    //     'كبير معلمين'
    // ]
}